'''Список на 10 элементов, заполненный случайно сгенерированными целыми
числами от 0 до 100. Необходимо, отсортировать список и посчитать сумму второго и предпоследнего
элемента (после сортировки).'''
import random

spisok = []# создаю пустой список
spisor_res = []# создаю пустой список
for i in range(10):# цикл по 10 элементам
    spisok.append(random.randint(0, 101))# добавляем в пустой список элементы от 0 до 100
spisok.sort()# применяю сортировку
print(spisok)# вывожу отсортированный список
print(spisok[1] + spisok[-2])  # вывожу сумму второго и предпоследнего елемента
                                #не знаю как подругому записать эту строчку используя метод sum


