'''Создать список на 10 элементов, заполненный целыми случайными числами
(диапазон на выбор, но конец диапазона больше 5). Удалить все элементы которые меньше 5 и найти среднее арифметическое.
Среднее арифметическое значение = сумма всех элементов разделенная на количество элементов'''
import random

spisok = []
spisok_res = []
sum = 0
count = 0
for i in range(10):
    spisok.append(random.randint(0, 30))  # создаем список из случайных значений в диапозоне от 0 до 30
print(spisok)  # просто выводим список из 10 случ значений
for x in spisok:  # создаем новый список с элементами, значение которых > 5
    if x > 5:
        spisok_res.append(x)  # добавляем в новый список все элементы, которые больше 5
print(spisok_res)
for i in spisok_res:  # создаем цикл для подсчета суммы элеметов и их колличества
    sum += i
    count += 1
print(sum)  # просто вывод суммы для проверки
print(sum / count)  # выводим среднее арифметическое
