'''
Создать кортеж на 15 элементов, кортеж заполнен с помощью генератора списков (кортежей),
квадратами целых чисел от 1 до 15.
И вывести его на экран.'''
print(tuple(i**2 for i in range(1, 15))) # заполняем квадратами с помощью генератора кортежей