'''Создать список в котором N элементов (N - введенное пользователем число). Заполнить список целыми случайными числами от 0 до 20. Вывести получившийся результат'''
import random
spisok = []
for i in range(int(input())):# цикл по диапозону введеному пользователем
    spisok.append(random.randint(0, 20))# добавляем в пустой список элементы
print(spisok)
