'''Создать массив на 20 элементов заполненный целыми случайными числами от 0 до 20.
Необходимо найти произведение элементов кратных 3, имеющие четный индекс.'''

import random

count = 0  # вводим переменную -счетчик
proisvedenie = 1  # вводим переменную-счетчик для произведения
spisok = []  # создаю пустой список
res = []  # создаю пустой список
res_2 = []  # создаю пустой список
for i in range(20):  # цикл по 20 элементам
    spisok.append(random.randint(0, 21))  # добавляем в пустой список элементы от 0 до 20
print(spisok)

for x in spisok:  #
    count += 1  # увеличиваем пер. -счетчик на 1
    if count % 2 == 0:  # делаем проверку на четный  индекс
        res.append(x)  # добаволяем элементы в новый список

print(res)  # выводим получившийся список
for y in res:
    if y % 3 == 0:  # проверяем на кратность 3
        res_2.append(y)  # добавляем получившиеся элементы в список
print(res_2)
for i in res_2:  # запускаем алгаритм для произведения
    proisvedenie *= i
print(proisvedenie)
# еще попробую сделать через генератор списков т.к мой способ очень долгий
